00004-domain-specific-languages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Domain Specific Languages / 领域特定语言</title>
<!-- 2017-10-02 Mon 14:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="TANG ZhiXiong" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="css/github-gist.min.css">
<link rel="stylesheet" type="text/css" href="css/main.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Domain Specific Languages / 领域特定语言</h1>
