00004-domain-specific-languages.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> 第一部分　叙述</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 第 1 章入门例子</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>什么是 DSL: domain specific language
</li>
</ul>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 哥特式建筑安全系统</h4>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 状态机模型</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Domain driven design 中的 ubiquitous language (speak the common language)
</li>
<li>分开了公共代码和可变代码
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> 为格兰特小姐的控制器编写程序</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>XML: 控制器的行为的任何修改都无需发布新的 JAR
</li>
<li>Extensive testing 广泛测试
</li>
<li>命令式模型: imperative
</li>
<li>DSL: 可能没有控制结果, 没有其他东西, 图灵不完备, 用它不能编写整个应用, 只能用来描述应用的一个小小方面, 其
简单性意味着它易于编辑和处理.
</li>
<li>外部 DSL, 内部 DSL
</li>
<li>内部 DSL 中的一个概念是 fluent interface (连贯性接口), 和 DSL 联系紧密
</li>
<li>非连贯性接口: command-query API
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> 语言和语义模型</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>almost always
</li>
<li>设计良好的 DSL, 语义模型至关重要
</li>
<li>DSL 只是模型的一个薄薄的 "门面" (facade), (tip: SLFJ 是各种 logging 库的 facade)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> 用代码生成</h4>
<div class="outline-text-4" id="text-3-1-5">
<ul class="org-ul">
<li>interpretation 解释
</li>
<li>code generation 代码生成, 笨拙: 需要额外的编译步骤; 优势: 解析器和生成代码可以用不同的语言
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> 使用语言工作台</h4>
<div class="outline-text-4" id="text-3-1-6">
<ul class="org-ul">
<li>语言工作台, 一个专用的 IDE, 可能带有图形界面 (程序员怀疑这种玩具式的工具)
</li>
<li>类似于语言工作台, 提供文本编辑器. 后 IntelliJ 的能力: 为基于文本的语言提供类似语法指导的编辑, 自动补全及其他类似的功能
</li>
<li>许多人不把电子表格当做编程环境: 把工具紧密地集成到了编程环境
</li>
<li>说明性编程 illustrative programming
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4">3.1.7</span> 可视化</h4>
<div class="outline-text-4" id="text-3-1-7">
<ul class="org-ul">
<li>类似 dot (graphviz) 的界面
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 第 2 章　使用 DSL</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 定义 DSL</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>domain specific languages 的四个关键因素:
<ul class="org-ul">
<li>computer programming language (计算机程序设计语言), 可以执行
</li>
<li>language nature (语言性), 连贯的表达能力
</li>
<li>limited expressiveness (受限的表达), 只支持特定领域所需特性的最小集 (MVP: minimum viable product)
</li>
<li>domain focus (针对领域), 明确性
</li>
</ul>
</li>
<li>分类:
<ul class="org-ul">
<li>外部 DSL
</li>
<li>内部 DSL
</li>
<li>语言工作台
</li>
</ul>
</li>
<li>command-query API 定义了抽象领域的词汇, 内部 DSL 在此基础上添加了语法
</li>
<li>内部 DSL 给人的感觉是一个整句, 而非无关命令的序列
</li>
<li>有限的表达性让 DSL 产生了独特性
</li>
<li>片段 DSL 和独立 DSL
<ul class="org-ul">
<li>片段 DSL 是和其他语言整合在一起的, 比如 regex
</li>
<li>sql 可以看成片段, 也可以看成独立 DSL
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> 为何需要 DSL</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>提高开发效率
</li>
<li>与领域专家的沟通
</li>
<li>执行环境的改变: 参考 XML 帮助 JAR 包配置不同的运行方式这一点
</li>
<li>提高开发效率
</li>
<li>其他计算模型 (比如状态机模型, 网络依赖模型, etc)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> DSL 的问题</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>语言噪音
</li>
<li>构建成本 (可维护性)
</li>
<li>集中营语言 (ghetto language): 小心 DSL 演变成通用语言
</li>
<li>一叶障目的抽象: 应当视 DSL 为一种 "不断演化, 尚未完结" 的事务
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> 广义的语言处理</h4>
</div>
<div id="outline-container-sec-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> DSL 的生命周期</h4>
<div class="outline-text-4" id="text-3-2-5">
<ul class="org-ul">
<li>先描述一个框架: command-query API -&gt; 构建一层 DSL 来简化
</li>
<li>先定义 DSL: 从场景开始 (最好和领域专家 pair)
</li>
<li>从最简单的用例开始, 采用测试驱动的方式开发
</li>
<li>基于模型发展 DSL: 模型生长 (model-seeded), 语言生长 (language-seeded)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> 设计优良的 DSL 从何而来</h4>
<div class="outline-text-4" id="text-3-2-6">
<ul class="org-ul">
<li>DSL 的总体目标: 对读者要清晰
</li>
<li>trick: 采用日常生活里的通用约定 (一个例子是 JSON 采用了程序员都见过的 [l,i,s,t], {object}, key:value 这几个符号标记法)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 第 3 章实现 DSL</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> DSL 处理之架构</h4>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> 解析器的工作方式</h4>
</div>
<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> 文法、语法和语义</h4>
</div>
<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> 解析中的数据</h4>
</div>
<div id="outline-container-sec-3-3-5" class="outline-4">
<h4 id="sec-3-3-5"><span class="section-number-4">3.3.5</span> 宏</h4>
</div>
<div id="outline-container-sec-3-3-6" class="outline-4">
<h4 id="sec-3-3-6"><span class="section-number-4">3.3.6</span> 测试 DSL</h4>
</div>
<div id="outline-container-sec-3-3-7" class="outline-4">
<h4 id="sec-3-3-7"><span class="section-number-4">3.3.7</span> 错误处理</h4>
</div>
<div id="outline-container-sec-3-3-8" class="outline-4">
<h4 id="sec-3-3-8"><span class="section-number-4">3.3.8</span> DSL 迁移</h4>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 第 4 章实现内部 DSL</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> 连贯 API 与命令–查询 API</h4>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> 解析层的需求</h4>
</div>
<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> 使用函数</h4>
</div>
<div id="outline-container-sec-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> 字面量集合</h4>
</div>
<div id="outline-container-sec-3-4-5" class="outline-4">
<h4 id="sec-3-4-5"><span class="section-number-4">3.4.5</span> 基于文法选择内部元素</h4>
</div>
<div id="outline-container-sec-3-4-6" class="outline-4">
<h4 id="sec-3-4-6"><span class="section-number-4">3.4.6</span> 闭包</h4>
</div>
<div id="outline-container-sec-3-4-7" class="outline-4">
<h4 id="sec-3-4-7"><span class="section-number-4">3.4.7</span> 解析树操作</h4>
</div>
<div id="outline-container-sec-3-4-8" class="outline-4">
<h4 id="sec-3-4-8"><span class="section-number-4">3.4.8</span> 标注</h4>
</div>
<div id="outline-container-sec-3-4-9" class="outline-4">
<h4 id="sec-3-4-9"><span class="section-number-4">3.4.9</span> 为字面量提供扩展</h4>
</div>
<div id="outline-container-sec-3-4-10" class="outline-4">
<h4 id="sec-3-4-10"><span class="section-number-4">3.4.10</span> 消除语法噪音</h4>
</div>
<div id="outline-container-sec-3-4-11" class="outline-4">
<h4 id="sec-3-4-11"><span class="section-number-4">3.4.11</span> 动态接收</h4>
</div>
<div id="outline-container-sec-3-4-12" class="outline-4">
<h4 id="sec-3-4-12"><span class="section-number-4">3.4.12</span> 提供类型检查</h4>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 第 5 章实现外部 DSL</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> 语法分析策略</h4>
</div>
<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> 输出生成策略</h4>
</div>
<div id="outline-container-sec-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> 解析中的概念</h4>
</div>
<div id="outline-container-sec-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> 混入另一种语言</h4>
</div>
<div id="outline-container-sec-3-5-5" class="outline-4">
<h4 id="sec-3-5-5"><span class="section-number-4">3.5.5</span> XML DSL</h4>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 第 6 章内部 DSL vs 外部 DSL</h3>
