00004-domain-specific-languages.org
*** 格兰特小姐的控制器（Java 和 ANTLR）
** 第 26 章内嵌解释器
*** 工作原理
*** 使用场景
*** 计算器（ANTLR 和 Java）
** 第 27 章外加代码
*** 工作原理
*** 使用场景
*** 嵌入动态代码（ANTLR、Java 和 JavaScript）
** 第 28 章可变分词方式
*** 工作原理
*** 使用场景
** 第 29 章嵌套的运算符表达式
*** 工作原理
*** 使用场景
** 第 30 章以换行符作为分隔符
*** 工作原理
*** 使用场景
** 第 31 章外部 DSL 拾遗
*** 语法缩进
*** 模块化文法
* 第四部分　内部 DSL 主题
** 第 32 章表达式生成器
*** 工作原理
*** 使用场景
*** 具有和没有生成器的连贯日历（Java）
*** 对于日历使用多个生成器（Java）
** 第 33 章函数序列
*** 工作原理
*** 使用场景
*** 简单的计算机配置（Java）
** 第 34 章嵌套函数
*** 工作原理
*** 使用场景
*** 简单计算机配置范例（Java）
*** 用标记处理多个不同的参数（C#）
*** 针对 IDE 支持使用子类型标记（Java）
*** 使用对象初始化器（C#）
*** 周期性事件（C#）
** 第 35 章方法级联
*** 工作原理
*** 使用场景
*** 简单的计算机配置范例（Java）
*** 带有属性的方法级联（C#）
*** 渐进式接口（C#）
** 第 36 章对象范围
*** 工作原理
*** 使用场景
*** 安全代码（C#）
*** 使用实例求值（Ruby）
*** 使用实例初始化器（Java）
** 第 37 章闭包
*** 工作原理
*** 使用场景
** 第 38 章嵌套闭包
*** 工作原理
*** 使用场景
*** 用嵌套闭包来包装函数序列（Ruby）
*** 简单的 C# 示例（C#）
*** 使用方法级联（Ruby）
*** 带显式闭包参数的函数序列（Ruby）
*** 采用实例级求值（Ruby）
** 第 39 章列表的字面构造
*** 工作原理
*** 使用场景
** 第 40 章 Literal Map
*** 工作原理
*** 使用场景
*** 使用 List 和 Map 表达计算机的配置信息（Ruby）
*** 演化为 Greenspun 式（Ruby）
** 第 41 章动态接收
*** 工作原理
*** 使用场景
*** 积分——使用方法名解析（Ruby）
*** 积分——使用方法级联（Ruby）
*** 去掉安全仪表盘控制器中的引用（JRuby）
** TODO 第 42 章标注
*** 工作原理
*** 使用场景
*** 用于运行时处理的特定语法（Java）
*** 使用类方法（Ruby）
*** 动态代码生成（Ruby）
** 第 43 章解析树操作
*** 工作原理
*** 使用场景
*** 由 C# 条件生成 IMAP 查询（C#）
** 第 44 章类符号表
44.1　工作原理
*** 使用场景
*** 在静态类型中实现类符号表（Java）
** 第 45 章文本润色
*** 工作原理
*** 使用场景
*** 使用润色的折扣规则（Ruby）
** 第 46 章为字面量提供扩展
*** 工作原理
*** 使用场景
*** 食谱配料（C#）
* 第五部分　其他计算模型
** 第 47 章适应性模型
*** 工作原理
*** 使用场景
** 第 48 章决策表
*** 工作原理
*** 使用场景
*** 为一个订单计算费用（C#）
** TODO 第 49 章依赖网络
*** 工作原理
*** 使用场景
*** 分析饮料（C#）
** 第 50 章产生式规则系统
*** 工作原理
*** 使用场景
*** 俱乐部会员校验（C#）
