00004-domain-specific-languages.html
<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> 第 25 章嵌入式语法翻译</h3>
<div class="outline-text-3" id="text-5-9">
</div><div id="outline-container-sec-5-9-1" class="outline-4">
<h4 id="sec-5-9-1"><span class="section-number-4">5.9.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-5-9-2" class="outline-4">
<h4 id="sec-5-9-2"><span class="section-number-4">5.9.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-5-9-3" class="outline-4">
<h4 id="sec-5-9-3"><span class="section-number-4">5.9.3</span> 格兰特小姐的控制器（Java 和 ANTLR）</h4>
</div>
</div>
<div id="outline-container-sec-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> 第 26 章内嵌解释器</h3>
<div class="outline-text-3" id="text-5-10">
</div><div id="outline-container-sec-5-10-1" class="outline-4">
<h4 id="sec-5-10-1"><span class="section-number-4">5.10.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-5-10-2" class="outline-4">
<h4 id="sec-5-10-2"><span class="section-number-4">5.10.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-5-10-3" class="outline-4">
<h4 id="sec-5-10-3"><span class="section-number-4">5.10.3</span> 计算器（ANTLR 和 Java）</h4>
</div>
</div>
<div id="outline-container-sec-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> 第 27 章外加代码</h3>
<div class="outline-text-3" id="text-5-11">
</div><div id="outline-container-sec-5-11-1" class="outline-4">
<h4 id="sec-5-11-1"><span class="section-number-4">5.11.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-5-11-2" class="outline-4">
<h4 id="sec-5-11-2"><span class="section-number-4">5.11.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-5-11-3" class="outline-4">
<h4 id="sec-5-11-3"><span class="section-number-4">5.11.3</span> 嵌入动态代码（ANTLR、Java 和 JavaScript）</h4>
</div>
</div>
<div id="outline-container-sec-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> 第 28 章可变分词方式</h3>
<div class="outline-text-3" id="text-5-12">
</div><div id="outline-container-sec-5-12-1" class="outline-4">
<h4 id="sec-5-12-1"><span class="section-number-4">5.12.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-5-12-2" class="outline-4">
<h4 id="sec-5-12-2"><span class="section-number-4">5.12.2</span> 使用场景</h4>
</div>
</div>
<div id="outline-container-sec-5-13" class="outline-3">
<h3 id="sec-5-13"><span class="section-number-3">5.13</span> 第 29 章嵌套的运算符表达式</h3>
<div class="outline-text-3" id="text-5-13">
</div><div id="outline-container-sec-5-13-1" class="outline-4">
<h4 id="sec-5-13-1"><span class="section-number-4">5.13.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-5-13-2" class="outline-4">
<h4 id="sec-5-13-2"><span class="section-number-4">5.13.2</span> 使用场景</h4>
</div>
</div>
<div id="outline-container-sec-5-14" class="outline-3">
<h3 id="sec-5-14"><span class="section-number-3">5.14</span> 第 30 章以换行符作为分隔符</h3>
<div class="outline-text-3" id="text-5-14">
</div><div id="outline-container-sec-5-14-1" class="outline-4">
<h4 id="sec-5-14-1"><span class="section-number-4">5.14.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-5-14-2" class="outline-4">
<h4 id="sec-5-14-2"><span class="section-number-4">5.14.2</span> 使用场景</h4>
</div>
</div>
<div id="outline-container-sec-5-15" class="outline-3">
<h3 id="sec-5-15"><span class="section-number-3">5.15</span> 第 31 章外部 DSL 拾遗</h3>
<div class="outline-text-3" id="text-5-15">
</div><div id="outline-container-sec-5-15-1" class="outline-4">
<h4 id="sec-5-15-1"><span class="section-number-4">5.15.1</span> 语法缩进</h4>
</div>
<div id="outline-container-sec-5-15-2" class="outline-4">
<h4 id="sec-5-15-2"><span class="section-number-4">5.15.2</span> 模块化文法</h4>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 第四部分　内部 DSL 主题</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 第 32 章表达式生成器</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> 具有和没有生成器的连贯日历（Java）</h4>
</div>
<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> 对于日历使用多个生成器（Java）</h4>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 第 33 章函数序列</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> 简单的计算机配置（Java）</h4>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 第 34 章嵌套函数</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> 简单计算机配置范例（Java）</h4>
</div>
<div id="outline-container-sec-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> 用标记处理多个不同的参数（C#）</h4>
</div>
<div id="outline-container-sec-6-3-5" class="outline-4">
<h4 id="sec-6-3-5"><span class="section-number-4">6.3.5</span> 针对 IDE 支持使用子类型标记（Java）</h4>
</div>
<div id="outline-container-sec-6-3-6" class="outline-4">
<h4 id="sec-6-3-6"><span class="section-number-4">6.3.6</span> 使用对象初始化器（C#）</h4>
</div>
<div id="outline-container-sec-6-3-7" class="outline-4">
<h4 id="sec-6-3-7"><span class="section-number-4">6.3.7</span> 周期性事件（C#）</h4>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 第 35 章方法级联</h3>
<div class="outline-text-3" id="text-6-4">
</div><div id="outline-container-sec-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-4-3" class="outline-4">
<h4 id="sec-6-4-3"><span class="section-number-4">6.4.3</span> 简单的计算机配置范例（Java）</h4>
</div>
<div id="outline-container-sec-6-4-4" class="outline-4">
<h4 id="sec-6-4-4"><span class="section-number-4">6.4.4</span> 带有属性的方法级联（C#）</h4>
</div>
<div id="outline-container-sec-6-4-5" class="outline-4">
<h4 id="sec-6-4-5"><span class="section-number-4">6.4.5</span> 渐进式接口（C#）</h4>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 第 36 章对象范围</h3>
<div class="outline-text-3" id="text-6-5">
</div><div id="outline-container-sec-6-5-1" class="outline-4">
<h4 id="sec-6-5-1"><span class="section-number-4">6.5.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-5-2" class="outline-4">
<h4 id="sec-6-5-2"><span class="section-number-4">6.5.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-5-3" class="outline-4">
<h4 id="sec-6-5-3"><span class="section-number-4">6.5.3</span> 安全代码（C#）</h4>
</div>
<div id="outline-container-sec-6-5-4" class="outline-4">
<h4 id="sec-6-5-4"><span class="section-number-4">6.5.4</span> 使用实例求值（Ruby）</h4>
</div>
<div id="outline-container-sec-6-5-5" class="outline-4">
<h4 id="sec-6-5-5"><span class="section-number-4">6.5.5</span> 使用实例初始化器（Java）</h4>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 第 37 章闭包</h3>
<div class="outline-text-3" id="text-6-6">
</div><div id="outline-container-sec-6-6-1" class="outline-4">
<h4 id="sec-6-6-1"><span class="section-number-4">6.6.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-6-2" class="outline-4">
<h4 id="sec-6-6-2"><span class="section-number-4">6.6.2</span> 使用场景</h4>
</div>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> 第 38 章嵌套闭包</h3>
<div class="outline-text-3" id="text-6-7">
</div><div id="outline-container-sec-6-7-1" class="outline-4">
<h4 id="sec-6-7-1"><span class="section-number-4">6.7.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-7-2" class="outline-4">
<h4 id="sec-6-7-2"><span class="section-number-4">6.7.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-7-3" class="outline-4">
<h4 id="sec-6-7-3"><span class="section-number-4">6.7.3</span> 用嵌套闭包来包装函数序列（Ruby）</h4>
</div>
<div id="outline-container-sec-6-7-4" class="outline-4">
<h4 id="sec-6-7-4"><span class="section-number-4">6.7.4</span> 简单的 C# 示例（C#）</h4>
</div>
<div id="outline-container-sec-6-7-5" class="outline-4">
<h4 id="sec-6-7-5"><span class="section-number-4">6.7.5</span> 使用方法级联（Ruby）</h4>
</div>
<div id="outline-container-sec-6-7-6" class="outline-4">
<h4 id="sec-6-7-6"><span class="section-number-4">6.7.6</span> 带显式闭包参数的函数序列（Ruby）</h4>
</div>
<div id="outline-container-sec-6-7-7" class="outline-4">
<h4 id="sec-6-7-7"><span class="section-number-4">6.7.7</span> 采用实例级求值（Ruby）</h4>
</div>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> 第 39 章列表的字面构造</h3>
<div class="outline-text-3" id="text-6-8">
</div><div id="outline-container-sec-6-8-1" class="outline-4">
<h4 id="sec-6-8-1"><span class="section-number-4">6.8.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-8-2" class="outline-4">
<h4 id="sec-6-8-2"><span class="section-number-4">6.8.2</span> 使用场景</h4>
</div>
</div>
<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> 第 40 章 Literal Map</h3>
<div class="outline-text-3" id="text-6-9">
</div><div id="outline-container-sec-6-9-1" class="outline-4">
<h4 id="sec-6-9-1"><span class="section-number-4">6.9.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-9-2" class="outline-4">
<h4 id="sec-6-9-2"><span class="section-number-4">6.9.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-9-3" class="outline-4">
<h4 id="sec-6-9-3"><span class="section-number-4">6.9.3</span> 使用 List 和 Map 表达计算机的配置信息（Ruby）</h4>
</div>
<div id="outline-container-sec-6-9-4" class="outline-4">
<h4 id="sec-6-9-4"><span class="section-number-4">6.9.4</span> 演化为 Greenspun 式（Ruby）</h4>
</div>
</div>
<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> 第 41 章动态接收</h3>
<div class="outline-text-3" id="text-6-10">
</div><div id="outline-container-sec-6-10-1" class="outline-4">
<h4 id="sec-6-10-1"><span class="section-number-4">6.10.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-10-2" class="outline-4">
<h4 id="sec-6-10-2"><span class="section-number-4">6.10.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-10-3" class="outline-4">
<h4 id="sec-6-10-3"><span class="section-number-4">6.10.3</span> 积分——使用方法名解析（Ruby）</h4>
</div>
<div id="outline-container-sec-6-10-4" class="outline-4">
<h4 id="sec-6-10-4"><span class="section-number-4">6.10.4</span> 积分——使用方法级联（Ruby）</h4>
</div>
<div id="outline-container-sec-6-10-5" class="outline-4">
<h4 id="sec-6-10-5"><span class="section-number-4">6.10.5</span> 去掉安全仪表盘控制器中的引用（JRuby）</h4>
</div>
</div>
<div id="outline-container-sec-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="section-number-3">6.11</span> <span class="todo TODO">TODO</span> 第 42 章标注</h3>
<div class="outline-text-3" id="text-6-11">
</div><div id="outline-container-sec-6-11-1" class="outline-4">
<h4 id="sec-6-11-1"><span class="section-number-4">6.11.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-11-2" class="outline-4">
<h4 id="sec-6-11-2"><span class="section-number-4">6.11.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-11-3" class="outline-4">
<h4 id="sec-6-11-3"><span class="section-number-4">6.11.3</span> 用于运行时处理的特定语法（Java）</h4>
</div>
<div id="outline-container-sec-6-11-4" class="outline-4">
<h4 id="sec-6-11-4"><span class="section-number-4">6.11.4</span> 使用类方法（Ruby）</h4>
</div>
<div id="outline-container-sec-6-11-5" class="outline-4">
<h4 id="sec-6-11-5"><span class="section-number-4">6.11.5</span> 动态代码生成（Ruby）</h4>
</div>
</div>
<div id="outline-container-sec-6-12" class="outline-3">
<h3 id="sec-6-12"><span class="section-number-3">6.12</span> 第 43 章解析树操作</h3>
<div class="outline-text-3" id="text-6-12">
</div><div id="outline-container-sec-6-12-1" class="outline-4">
<h4 id="sec-6-12-1"><span class="section-number-4">6.12.1</span> 工作原理</h4>
</div>
<div id="outline-container-sec-6-12-2" class="outline-4">
<h4 id="sec-6-12-2"><span class="section-number-4">6.12.2</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-12-3" class="outline-4">
<h4 id="sec-6-12-3"><span class="section-number-4">6.12.3</span> 由 C# 条件生成 IMAP 查询（C#）</h4>
</div>
</div>
<div id="outline-container-sec-6-13" class="outline-3">
<h3 id="sec-6-13"><span class="section-number-3">6.13</span> 第 44 章类符号表</h3>
<div class="outline-text-3" id="text-6-13">
<p>
44.1　工作原理
</p>
</div>
<div id="outline-container-sec-6-13-1" class="outline-4">
<h4 id="sec-6-13-1"><span class="section-number-4">6.13.1</span> 使用场景</h4>
</div>
<div id="outline-container-sec-6-13-2" class="outline-4">
<h4 id="sec-6-13-2"><span class="section-number-4">6.13.2</span> 在静态类型中实现类符号表（Java）</h4>
</div>
</div>
